wiki/2016-09-03-simHash_简介以及_java_实现.html

<div id="outline-container-orgf1e0abc" class="outline-2">
<h2 id="orgf1e0abc">4、示例代码：</h2>
<div class="outline-text-2" id="text-orgf1e0abc">
<div class="org-src-container">
<pre class="src src-java"><span style="font-style: italic;">/**</span>
<span style="font-style: italic;"> * Function: &#27880;&#65306;&#35813;&#31034;&#20363;&#31243;&#24207;&#26242;&#19981;&#25903;&#25345;&#20013;&#25991;</span>

<span style="font-style: italic;"> * Date:     2013-8-4 &#19979;&#21320;11:01:45</span>

<span style="font-style: italic;"> * </span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">@author</span><span style="font-style: italic;">   june: decli@qq.com</span>
<span style="font-style: italic;"> */</span>
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">java</span>.<span style="font-weight: bold; text-decoration: underline;">math</span>.<span style="font-weight: bold; text-decoration: underline;">BigInteger</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">java</span>.<span style="font-weight: bold; text-decoration: underline;">util</span>.<span style="font-weight: bold; text-decoration: underline;">ArrayList</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">java</span>.<span style="font-weight: bold; text-decoration: underline;">util</span>.<span style="font-weight: bold; text-decoration: underline;">HashMap</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">java</span>.<span style="font-weight: bold; text-decoration: underline;">util</span>.<span style="font-weight: bold; text-decoration: underline;">List</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">java</span>.<span style="font-weight: bold; text-decoration: underline;">util</span>.<span style="font-weight: bold; text-decoration: underline;">StringTokenizer</span>;

<span style="font-weight: bold;">public</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">SimHash</span> {

    <span style="font-weight: bold;">private</span> <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">tokens</span>;

    <span style="font-weight: bold;">private</span> <span style="font-weight: bold; text-decoration: underline;">BigInteger</span> <span style="font-weight: bold; font-style: italic;">intSimHash</span>;

    <span style="font-weight: bold;">private</span> <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">strSimHash</span>;

    <span style="font-weight: bold;">private</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">hashbits</span> = 64;

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">SimHash</span>(<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">tokens</span>) {
        <span style="font-weight: bold;">this</span>.tokens = tokens;
        <span style="font-weight: bold;">this</span>.intSimHash = <span style="font-weight: bold;">this</span>.simHash();
    }

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">SimHash</span>(<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">tokens</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">hashbits</span>) {
        <span style="font-weight: bold;">this</span>.tokens = tokens;
        <span style="font-weight: bold;">this</span>.hashbits = hashbits;
        <span style="font-weight: bold;">this</span>.intSimHash = <span style="font-weight: bold;">this</span>.simHash();
    }

    HashMap&lt;<span style="font-weight: bold; text-decoration: underline;">string</span>, <span style="font-weight: bold; text-decoration: underline;">integer</span>=<span style="font-style: italic;">""</span>&gt; wordMap = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">HashMap</span>&lt;<span style="font-weight: bold; text-decoration: underline;">string</span>, <span style="font-weight: bold; text-decoration: underline;">integer</span>=<span style="font-style: italic;">""</span>&gt;();

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">BigInteger</span> <span style="font-weight: bold;">simHash</span>() {
        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#23450;&#20041;&#29305;&#24449;&#21521;&#37327;/&#25968;&#32452;</span>
        <span style="font-weight: bold; text-decoration: underline;">int</span>[] <span style="font-weight: bold; font-style: italic;">v</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">int</span>[<span style="font-weight: bold;">this</span>.hashbits];
        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">1&#12289;&#23558;&#25991;&#26412;&#21435;&#25481;&#26684;&#24335;&#21518;, &#20998;&#35789;.</span>
        <span style="font-weight: bold; text-decoration: underline;">StringTokenizer</span> <span style="font-weight: bold; font-style: italic;">stringTokens</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">StringTokenizer</span>(<span style="font-weight: bold;">this</span>.tokens);
        <span style="font-weight: bold;">while</span> (stringTokens.hasMoreTokens()) {
            <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">temp</span> = stringTokens.nextToken();
            <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">2&#12289;&#23558;&#27599;&#19968;&#20010;&#20998;&#35789;hash&#20026;&#19968;&#32452;&#22266;&#23450;&#38271;&#24230;&#30340;&#25968;&#21015;.&#27604;&#22914; 64bit &#30340;&#19968;&#20010;&#25972;&#25968;.</span>
            <span style="font-weight: bold; text-decoration: underline;">BigInteger</span> <span style="font-weight: bold; font-style: italic;">t</span> = <span style="font-weight: bold;">this</span>.hash(temp);
            <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt; <span style="font-weight: bold;">this</span>.hashbits; i++) {
                <span style="font-weight: bold; text-decoration: underline;">BigInteger</span> <span style="font-weight: bold; font-style: italic;">bitmask</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BigInteger</span>(<span style="font-style: italic;">"1"</span>).shiftLeft(i);
                <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">3&#12289;&#24314;&#31435;&#19968;&#20010;&#38271;&#24230;&#20026;64&#30340;&#25972;&#25968;&#25968;&#32452;(&#20551;&#35774;&#35201;&#29983;&#25104;64&#20301;&#30340;&#25968;&#23383;&#25351;&#32441;,&#20063;&#21487;&#20197;&#26159;&#20854;&#23427;&#25968;&#23383;),</span>
                <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#23545;&#27599;&#19968;&#20010;&#20998;&#35789;hash&#21518;&#30340;&#25968;&#21015;&#36827;&#34892;&#21028;&#26029;,&#22914;&#26524;&#26159;1000...1,&#37027;&#20040;&#25968;&#32452;&#30340;&#31532;&#19968;&#20301;&#21644;&#26411;&#23614;&#19968;&#20301;&#21152;1,</span>
                <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#20013;&#38388;&#30340;62&#20301;&#20943;&#19968;,&#20063;&#23601;&#26159;&#35828;,&#36898;1&#21152;1,&#36898;0&#20943;1.&#19968;&#30452;&#21040;&#25226;&#25152;&#26377;&#30340;&#20998;&#35789;hash&#25968;&#21015;&#20840;&#37096;&#21028;&#26029;&#23436;&#27605;.</span>
                <span style="font-weight: bold;">if</span> (t.and(bitmask).signum() != 0) {
                    <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#36825;&#37324;&#26159;&#35745;&#31639;&#25972;&#20010;&#25991;&#26723;&#30340;&#25152;&#26377;&#29305;&#24449;&#30340;&#21521;&#37327;&#21644;</span>
                    <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#36825;&#37324;&#23454;&#38469;&#20351;&#29992;&#20013;&#38656;&#35201; +- &#26435;&#37325;&#65292;&#32780;&#19981;&#26159;&#31616;&#21333;&#30340; +1/-1&#65292;</span>
                    v[i] += 1;
                } <span style="font-weight: bold;">else</span> {
                    v[i] -= 1;
                }
            }
        }
        <span style="font-weight: bold; text-decoration: underline;">BigInteger</span> <span style="font-weight: bold; font-style: italic;">fingerprint</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BigInteger</span>(<span style="font-style: italic;">"0"</span>);
        <span style="font-weight: bold; text-decoration: underline;">StringBuffer</span> <span style="font-weight: bold; font-style: italic;">simHashBuffer</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">StringBuffer</span>();
        <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt; <span style="font-weight: bold;">this</span>.hashbits; i++) {
            <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">4&#12289;&#26368;&#21518;&#23545;&#25968;&#32452;&#36827;&#34892;&#21028;&#26029;,&#22823;&#20110;0&#30340;&#35760;&#20026;1,&#23567;&#20110;&#31561;&#20110;0&#30340;&#35760;&#20026;0,&#24471;&#21040;&#19968;&#20010; 64bit &#30340;&#25968;&#23383;&#25351;&#32441;/&#31614;&#21517;.</span>
            <span style="font-weight: bold;">if</span> (v[i] &gt;= 0) {
                fingerprint = fingerprint.add(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BigInteger</span>(<span style="font-style: italic;">"1"</span>).shiftLeft(i));
                simHashBuffer.append(<span style="font-style: italic;">"1"</span>);
            } <span style="font-weight: bold;">else</span> {
                simHashBuffer.append(<span style="font-style: italic;">"0"</span>);
            }
        }
        <span style="font-weight: bold;">this</span>.strSimHash = simHashBuffer.toString();
        System.out.println(<span style="font-weight: bold;">this</span>.strSimHash + <span style="font-style: italic;">" length "</span> + <span style="font-weight: bold;">this</span>.strSimHash.length());
        <span style="font-weight: bold;">return</span> fingerprint;
    }

    <span style="font-weight: bold;">private</span> <span style="font-weight: bold; text-decoration: underline;">BigInteger</span> <span style="font-weight: bold;">hash</span>(<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">source</span>) {
        <span style="font-weight: bold;">if</span> (source == <span style="font-weight: bold; text-decoration: underline;">null</span> || source.length() == 0) {
            <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BigInteger</span>(<span style="font-style: italic;">"0"</span>);
        } <span style="font-weight: bold;">else</span> {
            <span style="font-weight: bold; text-decoration: underline;">char</span>[] <span style="font-weight: bold; font-style: italic;">sourceArray</span> = source.toCharArray();
            <span style="font-weight: bold; text-decoration: underline;">BigInteger</span> <span style="font-weight: bold; font-style: italic;">x</span> = BigInteger.valueOf(((<span style="font-weight: bold; text-decoration: underline;">long</span>) sourceArray[0]) &lt;&lt; 7);
            <span style="font-weight: bold; text-decoration: underline;">BigInteger</span> <span style="font-weight: bold; font-style: italic;">m</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BigInteger</span>(<span style="font-style: italic;">"1000003"</span>);
            <span style="font-weight: bold; text-decoration: underline;">BigInteger</span> <span style="font-weight: bold; font-style: italic;">mask</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BigInteger</span>(<span style="font-style: italic;">"2"</span>).pow(<span style="font-weight: bold;">this</span>.hashbits).subtract(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BigInteger</span>(<span style="font-style: italic;">"1"</span>));
            <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">item</span> : sourceArray) {
                <span style="font-weight: bold; text-decoration: underline;">BigInteger</span> <span style="font-weight: bold; font-style: italic;">temp</span> = BigInteger.valueOf((<span style="font-weight: bold; text-decoration: underline;">long</span>) item);
                x = x.multiply(m).xor(temp).and(mask);
            }
            x = x.xor(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BigInteger</span>(String.valueOf(source.length())));
            <span style="font-weight: bold;">if</span> (x.equals(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BigInteger</span>(<span style="font-style: italic;">"-1"</span>))) {
                x = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BigInteger</span>(<span style="font-style: italic;">"-2"</span>);
            }
            <span style="font-weight: bold;">return</span> x;
        }
    }

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">hammingDistance</span>(<span style="font-weight: bold; text-decoration: underline;">SimHash</span> <span style="font-weight: bold; font-style: italic;">other</span>) {

        <span style="font-weight: bold; text-decoration: underline;">BigInteger</span> <span style="font-weight: bold; font-style: italic;">x</span> = <span style="font-weight: bold;">this</span>.intSimHash.xor(other.intSimHash);
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">tot</span> = 0;

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#32479;&#35745;x&#20013;&#20108;&#36827;&#21046;&#20301;&#25968;&#20026;1&#30340;&#20010;&#25968;</span>
        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#25105;&#20204;&#24819;&#24819;&#65292;&#19968;&#20010;&#20108;&#36827;&#21046;&#25968;&#20943;&#21435;1&#65292;&#37027;&#20040;&#65292;&#20174;&#26368;&#21518;&#37027;&#20010;1&#65288;&#21253;&#25324;&#37027;&#20010;1&#65289;&#21518;&#38754;&#30340;&#25968;&#23383;&#20840;&#37117;&#21453;&#20102;&#65292;&#23545;&#21543;&#65292;&#28982;&#21518;&#65292;n&amp;(n-1)&#23601;&#30456;&#24403;&#20110;&#25226;&#21518;&#38754;&#30340;&#25968;&#23383;&#28165;0&#65292;</span>
        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#25105;&#20204;&#30475;n&#33021;&#20570;&#22810;&#23569;&#27425;&#36825;&#26679;&#30340;&#25805;&#20316;&#23601;OK&#20102;&#12290;</span>

        <span style="font-weight: bold;">while</span> (x.signum() != 0) {
            tot += 1;
            x = x.and(x.subtract(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BigInteger</span>(<span style="font-style: italic;">"1"</span>)));
        }
        <span style="font-weight: bold;">return</span> tot;
    }

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">getDistance</span>(<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">str1</span>, <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">str2</span>) {
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">distance</span>;
        <span style="font-weight: bold;">if</span> (str1.length() != str2.length()) {
            distance = -1;
        } <span style="font-weight: bold;">else</span> {
            distance = 0;
            <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt; str1.<span style="font-weight: bold; text-decoration: underline;">length</span>(); i++) {
                <span style="font-weight: bold;">if</span> (str1.charAt(i) != str2.charAt(i)) {
                    distance++;
                }
            }
        }
        <span style="font-weight: bold;">return</span> distance;
    }

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">List</span> <span style="font-weight: bold;">subByDistance</span>(<span style="font-weight: bold; text-decoration: underline;">SimHash</span> <span style="font-weight: bold; font-style: italic;">simHash</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">distance</span>) {
        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#20998;&#25104;&#20960;&#32452;&#26469;&#26816;&#26597;</span>
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">numEach</span> = <span style="font-weight: bold;">this</span>.hashbits / (distance + 1);
        <span style="font-weight: bold; text-decoration: underline;">List</span> <span style="font-weight: bold; font-style: italic;">characters</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">ArrayList</span>();

        <span style="font-weight: bold; text-decoration: underline;">StringBuffer</span> <span style="font-weight: bold; font-style: italic;">buffer</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">StringBuffer</span>();

        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">k</span> = 0;
        <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt; <span style="font-weight: bold;">this</span>.intSimHash.bitLength(); i++) {
            <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#24403;&#19988;&#20165;&#24403;&#35774;&#32622;&#20102;&#25351;&#23450;&#30340;&#20301;&#26102;&#65292;&#36820;&#22238; true</span>
            <span style="font-weight: bold; text-decoration: underline;">boolean</span> <span style="font-weight: bold; font-style: italic;">sr</span> = simHash.intSimHash.testBit(i);

            <span style="font-weight: bold;">if</span> (sr) {
                buffer.append(<span style="font-style: italic;">"1"</span>);
            } <span style="font-weight: bold;">else</span> {
                buffer.append(<span style="font-style: italic;">"0"</span>);
            }

            <span style="font-weight: bold;">if</span> ((i + 1) % numEach == 0) {
                <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#23558;&#20108;&#36827;&#21046;&#36716;&#20026;BigInteger</span>
                <span style="font-weight: bold; text-decoration: underline;">BigInteger</span> <span style="font-weight: bold; font-style: italic;">eachValue</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BigInteger</span>(buffer.toString(), 2);
                System.out.println(<span style="font-style: italic;">"----"</span> + eachValue);
                buffer.delete(0, buffer.length());
                characters.add(eachValue);
            }
        }

        <span style="font-weight: bold;">return</span> characters;
    }

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">String</span>[] <span style="font-weight: bold; font-style: italic;">args</span>) {
        <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">s</span> = <span style="font-style: italic;">"This is a test string for testing"</span>;
        <span style="font-weight: bold; text-decoration: underline;">SimHash</span> <span style="font-weight: bold; font-style: italic;">hash1</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">SimHash</span>(s, 64);
        System.out.println(hash1.intSimHash + <span style="font-style: italic;">"  "</span> + hash1.intSimHash.bitLength());
        hash1.subByDistance(hash1, 3);

        s = <span style="font-style: italic;">"This is a test string for testing, This is a test string for testing abcdef"</span>;
        <span style="font-weight: bold; text-decoration: underline;">SimHash</span> <span style="font-weight: bold; font-style: italic;">hash2</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">SimHash</span>(s, 64);
        System.out.println(hash2.intSimHash + <span style="font-style: italic;">"  "</span> + hash2.intSimHash.bitCount());
        hash1.subByDistance(hash2, 3);

        s = <span style="font-style: italic;">"This is a test string for testing als"</span>;
        <span style="font-weight: bold; text-decoration: underline;">SimHash</span> <span style="font-weight: bold; font-style: italic;">hash3</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">SimHash</span>(s, 64);
        System.out.println(hash3.intSimHash + <span style="font-style: italic;">"  "</span> + hash3.intSimHash.bitCount());
        hash1.subByDistance(hash3, 4);

        System.out.println(<span style="font-style: italic;">"============================"</span>);

        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">dis</span> = hash1.getDistance(hash1.strSimHash, hash2.strSimHash);
        System.out.println(hash1.hammingDistance(hash2) + <span style="font-style: italic;">" "</span> + dis);

        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">dis2</span> = hash1.getDistance(hash1.strSimHash, hash3.strSimHash);
        System.out.println(hash1.hammingDistance(hash3) + <span style="font-style: italic;">" "</span> + dis2);

        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#36890;&#36807;Unicode&#32534;&#30721;&#26469;&#21028;&#26029;&#20013;&#25991;</span>
        <span style="font-weight: bold; font-style: italic;">/*</span><span style="font-weight: bold; font-style: italic;">String str = "&#20013;&#22269;chinese";</span>
<span style="font-weight: bold; font-style: italic;">        for (int i = 0; i &lt; str.length(); i++) {</span>
<span style="font-weight: bold; font-style: italic;">            System.out.println(str.substring(i, i + 1).matches("[\\u4e00-\\u9fbb]+"));</span>
<span style="font-weight: bold; font-style: italic;">        }*/</span>

    }
}

</pre>
</div>
</div>
</div>
