_src/wiki/2016-09-03-simHash_简介以及_java_实现.org
* 5、适用场景：
simHash在短文本的可行性：

测试相似文本的相似度与汉明距离

测试文本：

  20个城市名作为词串：

  北京,上海,香港,深圳,广州,台北,南京,大连,苏州,青岛,无锡,佛山,重庆,宁波,杭州,成都,武汉,澳门,天津,沈阳

相似度矩阵：

simHash码：

勘误：0.667, Hm:13 是对比的msg 1与2。

可见：相似度在0.8左右的Hamming距离为7，只有相似度高到0.9412，Hamming距离才近到4，
此时，反观Google对此算法的应用场景：网页近重复。

镜像网站、内容复制、嵌入广告、计数改变、少量修改。以上原因对于长文本来说造成的相
似度都会比较高，而对于短文本来说，如何处理海量数据的相似度文本更为合适的？测试短
文本（长度在8个中文字符～45个中文字符之间）相似性的误判率如下图所示：


* REF：
 1. simHash 简介以及java实现
    - http://blog.sina.com.cn/s/blog_4f27dbd501013ysm.html
 2. 对simhash算法的一些思考
    - http://2588084.blog.51cto.com/2578084/558873
 3. Simhash算法原理和网页查重应用
    - http://blog.sina.com.cn/s/blog_72995dcc010145ti.html
 4. 其它
    - http://www.cnblogs.com/zhengyun_ustc/archive/2012/06/12/sim.html
    - http://tech.uc.cn/?p=1086
    - http://jacoxu.com/?p=369  simHash是否适合短文本的相似文本匹配
    - https://github.com/sing1ee/simhash-java
