wiki/2016-09-03-simHash_简介以及_java_实现.html

<div id="outline-container-org0e50d95" class="outline-2">
<h2 id="org0e50d95">5、适用场景：</h2>
<div class="outline-text-2" id="text-org0e50d95">
<p>
simHash在短文本的可行性：
</p>

<p>
测试相似文本的相似度与汉明距离
</p>

<p>
测试文本：
</p>

<p>
20个城市名作为词串：
</p>

<p>
北京,上海,香港,深圳,广州,台北,南京,大连,苏州,青岛,无锡,佛山,重庆,宁波,杭州,成都,武汉,澳门,天津,沈阳
</p>

<p>
相似度矩阵：
</p>

<p>
simHash码：
</p>

<p>
勘误：0.667, Hm:13 是对比的msg 1与2。
</p>

<p>
可见：相似度在0.8左右的Hamming距离为7，只有相似度高到0.9412，Hamming距离才近到4，
此时，反观Google对此算法的应用场景：网页近重复。
</p>

<p>
镜像网站、内容复制、嵌入广告、计数改变、少量修改。以上原因对于长文本来说造成的相
似度都会比较高，而对于短文本来说，如何处理海量数据的相似度文本更为合适的？测试短
文本（长度在8个中文字符～45个中文字符之间）相似性的误判率如下图所示：
</p>
</div>
</div>


<div id="outline-container-org24bb009" class="outline-2">
<h2 id="org24bb009">REF：</h2>
<div class="outline-text-2" id="text-org24bb009">
<ol class="org-ol">
<li>simHash 简介以及java实现
<ul class="org-ul">
<li><a href="http://blog.sina.com.cn/s/blog_4f27dbd501013ysm.html">http://blog.sina.com.cn/s/blog_4f27dbd501013ysm.html</a></li>
</ul></li>
<li>对simhash算法的一些思考
<ul class="org-ul">
<li><a href="http://2588084.blog.51cto.com/2578084/558873">http://2588084.blog.51cto.com/2578084/558873</a></li>
</ul></li>
<li>Simhash算法原理和网页查重应用
<ul class="org-ul">
<li><a href="http://blog.sina.com.cn/s/blog_72995dcc010145ti.html">http://blog.sina.com.cn/s/blog_72995dcc010145ti.html</a></li>
</ul></li>
<li>其它
<ul class="org-ul">
<li><a href="http://www.cnblogs.com/zhengyun_ustc/archive/2012/06/12/sim.html">http://www.cnblogs.com/zhengyun_ustc/archive/2012/06/12/sim.html</a></li>
<li><a href="http://tech.uc.cn/?p=1086">http://tech.uc.cn/?p=1086</a></li>
<li><a href="http://jacoxu.com/?p=369%C2%A0%C2%A0simHash%E6%98%AF%E5%90%A6%E9%80%82%E5%90%88%E7%9F%AD%E6%96%87%E6%9C%AC%E7%9A%84%E7%9B%B8%E4%BC%BC%E6%96%87%E6%9C%AC%E5%8C%B9%E9%85%8D">http://jacoxu.com/?p=369  simHash是否适合短文本的相似文本匹配</a></li>
<li><a href="https://github.com/sing1ee/simhash-java">https://github.com/sing1ee/simhash-java</a></li>
</ul></li>
</ol>
</div>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
